MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J90/mcu.h
extern volatile LCDDATA11bits_t LCDDATA11bits __at(0xF71);
// bitfield macros
#define _LCDDATA11_LCDDATA11_POSN                           0x0
#define _LCDDATA11_LCDDATA11_POSITION                       0x0
#define _LCDDATA11_LCDDATA11_SIZE                           0x8
#define _LCDDATA11_LCDDATA11_LENGTH                         0x8
#define _LCDDATA11_LCDDATA11_MASK                           0xFF
#define _LCDDATA11_S40C1_POSN                               0x0
#define _LCDDATA11_S40C1_POSITION                           0x0
#define _LCDDATA11_S40C1_SIZE                               0x1
#define _LCDDATA11_S40C1_LENGTH                             0x1
#define _LCDDATA11_S40C1_MASK                               0x1
#define _LCDDATA11_S41C1_POSN                               0x1
#define _LCDDATA11_S41C1_POSITION                           0x1
#define _LCDDATA11_S41C1_SIZE                               0x1
#define _LCDDATA11_S41C1_LENGTH                             0x1
#define _LCDDATA11_S41C1_MASK                               0x2
#define _LCDDATA11_S42C1_POSN                               0x2
#define _LCDDATA11_S42C1_POSITION                           0x2
#define _LCDDATA11_S42C1_SIZE                               0x1
#define _LCDDATA11_S42C1_LENGTH                             0x1
#define _LCDDATA11_S42C1_MASK                               0x4
#define _LCDDATA11_S43C1_POSN                               0x3
#define _LCDDATA11_S43C1_POSITION                           0x3
#define _LCDDATA11_S43C1_SIZE                               0x1
#define _LCDDATA11_S43C1_LENGTH                             0x1
#define _LCDDATA11_S43C1_MASK                               0x8
#define _LCDDATA11_S44C1_POSN                               0x4
#define _LCDDATA11_S44C1_POSITION                           0x4
#define _LCDDATA11_S44C1_SIZE                               0x1
#define _LCDDATA11_S44C1_LENGTH                             0x1
#define _LCDDATA11_S44C1_MASK                               0x10
#define _LCDDATA11_S45C1_POSN                               0x5
#define _LCDDATA11_S45C1_POSITION                           0x5
#define _LCDDATA11_S45C1_SIZE                               0x1
#define _LCDDATA11_S45C1_LENGTH                             0x1
#define _LCDDATA11_S45C1_MASK                               0x20
#define _LCDDATA11_S46C1_POSN                               0x6
#define _LCDDATA11_S46C1_POSITION                           0x6
#define _LCDDATA11_S46C1_SIZE                               0x1
#define _LCDDATA11_S46C1_LENGTH                             0x1
#define _LCDDATA11_S46C1_MASK                               0x40
#define _LCDDATA11_S47C1_POSN                               0x7
#define _LCDDATA11_S47C1_POSITION                           0x7
#define _LCDDATA11_S47C1_SIZE                               0x1
#define _LCDDATA11_S47C1_LENGTH                             0x1
#define _LCDDATA11_S47C1_MASK                               0x80
#define _LCDDATA11_SEG40COM1_POSN                           0x0
#define _LCDDATA11_SEG40COM1_POSITION                       0x0
#define _LCDDATA11_SEG40COM1_SIZE                           0x1
#define _LCDDATA11_SEG40COM1_LENGTH                         0x1
#define _LCDDATA11_SEG40COM1_MASK                           0x1
#define _LCDDATA11_SEG41COM1_POSN                           0x1
#define _LCDDATA11_SEG41COM1_POSITION                       0x1
#define _LCDDATA11_SEG41COM1_SIZE                           0x1
#define _LCDDATA11_SEG41COM1_LENGTH                         0x1
#define _LCDDATA11_SEG41COM1_MASK                           0x2
#define _LCDDATA11_SEG42COM1_POSN                           0x2
#define _LCDDATA11_SEG42COM1_POSITION                       0x2
#define _LCDDATA11_SEG42COM1_SIZE                           0x1
#define _LCDDATA11_SEG42COM1_LENGTH                         0x1
#define _LCDDATA11_SEG42COM1_MASK                           0x4
#define _LCDDATA11_SEG43COM1_POSN                           0x3
#define _LCDDATA11_SEG43COM1_POSITION                       0x3
#define _LCDDATA11_SEG43COM1_SIZE                           0x1
#define _LCDDATA11_SEG43COM1_LENGTH                         0x1
#define _LCDDATA11_SEG43COM1_MASK                           0x8
#define _LCDDATA11_SEG44COM1_POSN                           0x4
#define _LCDDATA11_SEG44COM1_POSITION                       0x4
#define _LCDDATA11_SEG44COM1_SIZE                           0x1
#define _LCDDATA11_SEG44COM1_LENGTH                         0x1
#define _LCDDATA11_SEG44COM1_MASK                           0x10
#define _LCDDATA11_SEG45COM1_POSN                           0x5
#define _LCDDATA11_SEG45COM1_POSITION                       0x5
#define _LCDDATA11_SEG45COM1_SIZE                           0x1
#define _LCDDATA11_SEG45COM1_LENGTH                         0x1
#define _LCDDATA11_SEG45COM1_MASK                           0x20
#define _LCDDATA11_SEG46COM1_POSN                           0x6
#define _LCDDATA11_SEG46COM1_POSITION                       0x6
#define _LCDDATA11_SEG46COM1_SIZE                           0x1
#define _LCDDATA11_SEG46COM1_LENGTH                         0x1
#define _LCDDATA11_SEG46COM1_MASK                           0x40
#define _LCDDATA11_SEG47COM1_POSN                           0x7
#define _LCDDATA11_SEG47COM1_POSITION                       0x7
#define _LCDDATA11_SEG47COM1_SIZE                           0x1
#define _LCDDATA11_SEG47COM1_LENGTH                         0x1
#define _LCDDATA11_SEG47COM1_MASK                           0x80
#define _LCDDATA11_ADMSK1_POSN                              0x1
#define _LCDDATA11_ADMSK1_POSITION                          0x1
#define _LCDDATA11_ADMSK1_SIZE                              0x1
#define _LCDDATA11_ADMSK1_LENGTH                            0x1
#define _LCDDATA11_ADMSK1_MASK                              0x2
#define _LCDDATA11_ADMSK2_POSN                              0x2
#define _LCDDATA11_ADMSK2_POSITION                          0x2
#define _LCDDATA11_ADMSK2_SIZE                              0x1
#define _LCDDATA11_ADMSK2_LENGTH                            0x1
#define _LCDDATA11_ADMSK2_MASK                              0x4
#define _LCDDATA11_ADMSK3_POSN                              0x3
#define _LCDDATA11_ADMSK3_POSITION                          0x3
#define _LCDDATA11_ADMSK3_SIZE                              0x1
#define _LCDDATA11_ADMSK3_LENGTH                            0x1
#define _LCDDATA11_ADMSK3_MASK                              0x8
#define _LCDDATA11_ADMSK4_POSN                              0x4
#define _LCDDATA11_ADMSK4_POSITION                          0x4
#define _LCDDATA11_ADMSK4_SIZE                              0x1
#define _LCDDATA11_ADMSK4_LENGTH                            0x1
#define _LCDDATA11_ADMSK4_MASK                              0x10
#define _LCDDATA11_ADMSK5_POSN                              0x5
#define _LCDDATA11_ADMSK5_POSITION                          0x5
#define _LCDDATA11_ADMSK5_SIZE                              0x1
#define _LCDDATA11_ADMSK5_LENGTH                            0x1
#define _LCDDATA11_ADMSK5_MASK                              0x20

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
extern volatile unsigned char           LCDDATA12           __at(0xF72);
#ifndef _LIB_BUILD
asm("LCDDATA12 equ 0F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA12              :8;
    };
    struct {
        unsigned S00C2                  :1;
        unsigned S01C2                  :1;
        unsigned S02C2                  :1;
        unsigned S03C2                  :1;
        unsigned S04C2                  :1;
        unsigned S05C2                  :1;
        unsigned S06C2                  :1;
        unsigned S07C2                  :1;
    };
    struct {
        unsigned SEG0COM2               :1;
        unsigned SEG1COM2               :1;
        unsigned SEG2COM2               :1;
        unsigned SEG3COM2               :1;
        unsigned SEG4COM2               :1;
        unsigned SEG5COM2               :1;
        unsigned SEG6COM2               :1;
        unsigned SEG7COM2               :1;
    };
    struct {
        unsigned S0C2                   :1;
        unsigned S1C2                   :1;
        unsigned S2C2                   :1;
        unsigned S3C2                   :1;
        unsigned S4C2                   :1;
        unsigned S5C2                   :1;
        unsigned S6C2                   :1;
        unsigned S7C2                   :1;
    };
    struct {
        unsigned SSPM012                :1;
        unsigned SSPM112                :1;
        unsigned SSPM212                :1;
        unsigned SSPM312                :1;
    };
} LCDDATA12bits_t;
extern volatile LCDDATA12bits_t LCDDATA12bits __at(0xF72);
// bitfield macros
#define _LCDDATA12_LCDDATA12_POSN                           0x0
#define _LCDDATA12_LCDDATA12_POSITION                       0x0
#define _LCDDATA12_LCDDATA12_SIZE                           0x8
#define _LCDDATA12_LCDDATA12_LENGTH                         0x8
#define _LCDDATA12_LCDDATA12_MASK                           0xFF
#define _LCDDATA12_S00C2_POSN                               0x0
#define _LCDDATA12_S00C2_POSITION                           0x0
#define _LCDDATA12_S00C2_SIZE                               0x1
#define _LCDDATA12_S00C2_LENGTH                             0x1
#define _LCDDATA12_S00C2_MASK                               0x1
#define _LCDDATA12_S01C2_POSN                               0x1
#define _LCDDATA12_S01C2_POSITION                           0x1
#define _LCDDATA12_S01C2_SIZE                               0x1
#define _LCDDATA12_S01C2_LENGTH                             0x1
#define _LCDDATA12_S01C2_MASK                               0x2
#define _LCDDATA12_S02C2_POSN                               0x2
#define _LCDDATA12_S02C2_POSITION                           0x2
#define _LCDDATA12_S02C2_SIZE                               0x1
#define _LCDDATA12_S02C2_LENGTH                             0x1
#define _LCDDATA12_S02C2_MASK                               0x4
#define _LCDDATA12_S03C2_POSN                               0x3
#define _LCDDATA12_S03C2_POSITION                           0x3
#define _LCDDATA12_S03C2_SIZE                               0x1
#define _LCDDATA12_S03C2_LENGTH                             0x1
#define _LCDDATA12_S03C2_MASK                               0x8
#define _LCDDATA12_S04C2_POSN                               0x4
#define _LCDDATA12_S04C2_POSITION                           0x4
#define _LCDDATA12_S04C2_SIZE                               0x1
#define _LCDDATA12_S04C2_LENGTH                             0x1
#define _LCDDATA12_S04C2_MASK                               0x10
#define _LCDDATA12_S05C2_POSN                               0x5
#define _LCDDATA12_S05C2_POSITION                           0x5
#define _LCDDATA12_S05C2_SIZE                               0x1
#define _LCDDATA12_S05C2_LENGTH                             0x1
#define _LCDDATA12_S05C2_MASK                               0x20
#define _LCDDATA12_S06C2_POSN                               0x6
#define _LCDDATA12_S06C2_POSITION                           0x6
#define _LCDDATA12_S06C2_SIZE                               0x1
#define _LCDDATA12_S06C2_LENGTH                             0x1
#define _LCDDATA12_S06C2_MASK                               0x40
#define _LCDDATA12_S07C2_POSN                               0x7
#define _LCDDATA12_S07C2_POSITION                           0x7
#define _LCDDATA12_S07C2_SIZE                               0x1
#define _LCDDATA12_S07C2_LENGTH                             0x1
#define _LCDDATA12_S07C2_MASK                               0x80
#define _LCDDATA12_SEG0COM2_POSN                            0x0
#define _LCDDATA12_SEG0COM2_POSITION                        0x0
#define _LCDDATA12_SEG0COM2_SIZE                            0x1
#define _LCDDATA12_SEG0COM2_LENGTH                          0x1
#define _LCDDATA12_SEG0COM2_MASK                            0x1
#define _LCDDATA12_SEG1COM2_POSN                            0x1
#define _LCDDATA12_SEG1COM2_POSITION                        0x1
#define _LCDDATA12_SEG1COM2_SIZE                            0x1
#define _LCDDATA12_SEG1COM2_LENGTH                          0x1
#define _LCDDATA12_SEG1COM2_MASK                            0x2
#define _LCDDATA12_SEG2COM2_POSN                            0x2
#define _LCDDATA12_SEG2COM2_POSITION                        0x2
#define _LCDDATA12_SEG2COM2_SIZE                            0x1
#define _LCDDATA12_SEG2COM2_LENGTH                          0x1
#define _LCDDATA12_SEG2COM2_MASK                            0x4
#define _LCDDATA12_SEG3COM2_POSN                            0x3
#define _LCDDATA12_SEG3COM2_POSITION                        0x3
#define _LCDDATA12_SEG3COM2_SIZE                            0x1
#define _LCDDATA12_SEG3COM2_LENGTH                          0x1
#define _LCDDATA12_SEG3COM2_MASK                            0x8
#define _LCDDATA12_SEG4COM2_POSN                            0x4
#define _LCDDATA12_SEG4COM2_POSITION                        0x4
#define _LCDDATA12_SEG4COM2_SIZE                            0x1
#define _LCDDATA12_SEG4COM2_LENGTH                          0x1
#define _LCDDATA12_SEG4COM2_MASK                            0x10
#define _LCDDATA12_SEG5COM2_POSN                            0x5
#define _LCDDATA12_SEG5COM2_POSITION                        0x5
#define _LCDDATA12_SEG5COM2_SIZE                            0x1
#define _LCDDATA12_SEG5COM2_LENGTH                          0x1
#define _LCDDATA12_SEG5COM2_MASK                            0x20
#define _LCDDATA12_SEG6COM2_POSN                            0x6
#define _LCDDATA12_SEG6COM2_POSITION                        0x6
#define _LCDDATA12_SEG6COM2_SIZE                            0x1
#define _LCDDATA12_SEG6COM2_LENGTH                          0x1
#define _LCDDATA12_SEG6COM2_MASK                            0x40
#define _LCDDATA12_SEG7COM2_POSN                            0x7
#define _LCDDATA12_SEG7COM2_POSITION                        0x7
#define _LCDDATA12_SEG7COM2_SIZE                            0x1
#define _LCDDATA12_SEG7COM2_LENGTH                          0x1
#define _LCDDATA12_SEG7COM2_MASK                            0x80
#define _LCDDATA12_S0C2_POSN                                0x0
#define _LCDDATA12_S0C2_POSITION                            0x0
#define _LCDDATA12_S0C2_SIZE                                0x1
#define _LCDDATA12_S0C2_LENGTH                              0x1
#define _LCDDATA12_S0C2_MASK                                0x1
#define _LCDDATA12_S1C2_POSN                                0x1
#define _LCDDATA12_S1C2_POSITION                            0x1
#define _LCDDATA12_S1C2_SIZE                                0x1
#define _LCDDATA12_S1C2_LENGTH                              0x1
#define _LCDDATA12_S1C2_MASK                                0x2
#define _LCDDATA12_S2C2_POSN                                0x2
#define _LCDDATA12_S2C2_POSITION                            0x2
#define _LCDDATA12_S2C2_SIZE                                0x1
#define _LCDDATA12_S2C2_LENGTH                              0x1
#define _LCDDATA12_S2C2_MASK                                0x4
#define _LCDDATA12_S3C2_POSN                                0x3
#define _LCDDATA12_S3C2_POSITION                            0x3
#define _LCDDATA12_S3C2_SIZE                                0x1
#define _LCDDATA12_S3C2_LENGTH                              0x1
#define _LCDDATA12_S3C2_MASK                                0x8
#define _LCDDATA12_S4C2_POSN                                0x4
#define _LCDDATA12_S4C2_POSITION                            0x4
#define _LCDDATA12_S4C2_SIZE                                0x1
#define _LCDDATA12_S4C2_LENGTH                              0x1
#define _LCDDATA12_S4C2_MASK                                0x10
#define _LCDDATA12_S5C2_POSN                                0x5
#define _LCDDATA12_S5C2_POSITION                            0x5
#define _LCDDATA12_S5C2_SIZE                                0x1
#define _LCDDATA12_S5C2_LENGTH                              0x1
#define _LCDDATA12_S5C2_MASK                                0x20
#define _LCDDATA12_S6C2_POSN                                0x6
#define _LCDDATA12_S6C2_POSITION                            0x6
#define _LCDDATA12_S6C2_SIZE                                0x1
#define _LCDDATA12_S6C2_LENGTH                              0x1
#define _LCDDATA12_S6C2_MASK                                0x40
#define _LCDDATA12_S7C2_POSN                                0x7
#define _LCDDATA12_S7C2_POSITION                            0x7
#define _LCDDATA12_S7C2_SIZE                                0x1
#define _LCDDATA12_S7C2_LENGTH                              0x1
#define _LCDDATA12_S7C2_MASK                                0x80
#define _LCDDATA12_SSPM012_POSN                             0x0
#define _LCDDATA12_SSPM012_POSITION                         0x0
#define _LCDDATA12_SSPM012_SIZE                             0x1
#define _LCDDATA12_SSPM012_LENGTH                           0x1
#define _LCDDATA12_SSPM012_MASK                             0x1
#define _LCDDATA12_SSPM112_POSN                             0x1
#define _LCDDATA12_SSPM112_POSITION                         0x1
#define _LCDDATA12_SSPM112_SIZE                             0x1
#define _LCDDATA12_SSPM112_LENGTH                           0x1
#define _LCDDATA12_SSPM112_MASK                             0x2
#define _LCDDATA12_SSPM212_POSN                             0x2
#define _LCDDATA12_SSPM212_POSITION                         0x2
#define _LCDDATA12_SSPM212_SIZE                             0x1
#define _LCDDATA12_SSPM212_LENGTH                           0x1
#define _LCDDATA12_SSPM212_MASK                             0x4
#define _LCDDATA12_SSPM312_POSN                             0x3
#define _LCDDATA12_SSPM312_POSITION                         0x3
#define _LCDDATA12_SSPM312_SIZE                             0x1
#define _LCDDATA12_SSPM312_LENGTH                           0x1
#define _LCDDATA12_SSPM312_MASK                             0x8

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
extern volatile unsigned char           LCDDATA13           __at(0xF73);
#ifndef _LIB_BUILD
asm("LCDDATA13 equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA13              :8;
    };
    struct {
        unsigned S8C2                   :1;
        unsigned S9C2                   :1;
        unsigned S10C2                  :1;
        unsigned S11C2                  :1;
        unsigned S12C2                  :1;
        unsigned S13C2                  :1;
        unsigned S14C2                  :1;
        unsigned S15C2                  :1;
    };
    struct {
        unsigned SEG8COM2               :1;
        unsigned SEG9COM2               :1;
        unsigned SEG10COM2              :1;
        unsigned SEG11COM2              :1;
        unsigned SEG12COM2              :1;
        unsigned SEG13COM2              :1;
        unsigned SEG14COM2              :1;
        unsigned SEG15COM2              :1;
    };
    struct {
        unsigned S08C2                  :1;
        unsigned S09C2                  :1;
    };
} LCDDATA13bits_t;
