MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J90/mcu.h
extern volatile LCDDATA19bits_t LCDDATA19bits __at(0xF79);
// bitfield macros
#define _LCDDATA19_LCDDATA19_POSN                           0x0
#define _LCDDATA19_LCDDATA19_POSITION                       0x0
#define _LCDDATA19_LCDDATA19_SIZE                           0x8
#define _LCDDATA19_LCDDATA19_LENGTH                         0x8
#define _LCDDATA19_LCDDATA19_MASK                           0xFF
#define _LCDDATA19_S8C3_POSN                                0x0
#define _LCDDATA19_S8C3_POSITION                            0x0
#define _LCDDATA19_S8C3_SIZE                                0x1
#define _LCDDATA19_S8C3_LENGTH                              0x1
#define _LCDDATA19_S8C3_MASK                                0x1
#define _LCDDATA19_S9C3_POSN                                0x1
#define _LCDDATA19_S9C3_POSITION                            0x1
#define _LCDDATA19_S9C3_SIZE                                0x1
#define _LCDDATA19_S9C3_LENGTH                              0x1
#define _LCDDATA19_S9C3_MASK                                0x2
#define _LCDDATA19_S10C3_POSN                               0x2
#define _LCDDATA19_S10C3_POSITION                           0x2
#define _LCDDATA19_S10C3_SIZE                               0x1
#define _LCDDATA19_S10C3_LENGTH                             0x1
#define _LCDDATA19_S10C3_MASK                               0x4
#define _LCDDATA19_S11C3_POSN                               0x3
#define _LCDDATA19_S11C3_POSITION                           0x3
#define _LCDDATA19_S11C3_SIZE                               0x1
#define _LCDDATA19_S11C3_LENGTH                             0x1
#define _LCDDATA19_S11C3_MASK                               0x8
#define _LCDDATA19_S12C3_POSN                               0x4
#define _LCDDATA19_S12C3_POSITION                           0x4
#define _LCDDATA19_S12C3_SIZE                               0x1
#define _LCDDATA19_S12C3_LENGTH                             0x1
#define _LCDDATA19_S12C3_MASK                               0x10
#define _LCDDATA19_S13C3_POSN                               0x5
#define _LCDDATA19_S13C3_POSITION                           0x5
#define _LCDDATA19_S13C3_SIZE                               0x1
#define _LCDDATA19_S13C3_LENGTH                             0x1
#define _LCDDATA19_S13C3_MASK                               0x20
#define _LCDDATA19_S14C3_POSN                               0x6
#define _LCDDATA19_S14C3_POSITION                           0x6
#define _LCDDATA19_S14C3_SIZE                               0x1
#define _LCDDATA19_S14C3_LENGTH                             0x1
#define _LCDDATA19_S14C3_MASK                               0x40
#define _LCDDATA19_S15C3_POSN                               0x7
#define _LCDDATA19_S15C3_POSITION                           0x7
#define _LCDDATA19_S15C3_SIZE                               0x1
#define _LCDDATA19_S15C3_LENGTH                             0x1
#define _LCDDATA19_S15C3_MASK                               0x80
#define _LCDDATA19_SEG8COM3_POSN                            0x0
#define _LCDDATA19_SEG8COM3_POSITION                        0x0
#define _LCDDATA19_SEG8COM3_SIZE                            0x1
#define _LCDDATA19_SEG8COM3_LENGTH                          0x1
#define _LCDDATA19_SEG8COM3_MASK                            0x1
#define _LCDDATA19_SEG9COM3_POSN                            0x1
#define _LCDDATA19_SEG9COM3_POSITION                        0x1
#define _LCDDATA19_SEG9COM3_SIZE                            0x1
#define _LCDDATA19_SEG9COM3_LENGTH                          0x1
#define _LCDDATA19_SEG9COM3_MASK                            0x2
#define _LCDDATA19_SEG10COM3_POSN                           0x2
#define _LCDDATA19_SEG10COM3_POSITION                       0x2
#define _LCDDATA19_SEG10COM3_SIZE                           0x1
#define _LCDDATA19_SEG10COM3_LENGTH                         0x1
#define _LCDDATA19_SEG10COM3_MASK                           0x4
#define _LCDDATA19_SEG11COM3_POSN                           0x3
#define _LCDDATA19_SEG11COM3_POSITION                       0x3
#define _LCDDATA19_SEG11COM3_SIZE                           0x1
#define _LCDDATA19_SEG11COM3_LENGTH                         0x1
#define _LCDDATA19_SEG11COM3_MASK                           0x8
#define _LCDDATA19_SEG12COM3_POSN                           0x4
#define _LCDDATA19_SEG12COM3_POSITION                       0x4
#define _LCDDATA19_SEG12COM3_SIZE                           0x1
#define _LCDDATA19_SEG12COM3_LENGTH                         0x1
#define _LCDDATA19_SEG12COM3_MASK                           0x10
#define _LCDDATA19_SEG13COM3_POSN                           0x5
#define _LCDDATA19_SEG13COM3_POSITION                       0x5
#define _LCDDATA19_SEG13COM3_SIZE                           0x1
#define _LCDDATA19_SEG13COM3_LENGTH                         0x1
#define _LCDDATA19_SEG13COM3_MASK                           0x20
#define _LCDDATA19_SEG14COM3_POSN                           0x6
#define _LCDDATA19_SEG14COM3_POSITION                       0x6
#define _LCDDATA19_SEG14COM3_SIZE                           0x1
#define _LCDDATA19_SEG14COM3_LENGTH                         0x1
#define _LCDDATA19_SEG14COM3_MASK                           0x40
#define _LCDDATA19_SEG15COM3_POSN                           0x7
#define _LCDDATA19_SEG15COM3_POSITION                       0x7
#define _LCDDATA19_SEG15COM3_SIZE                           0x1
#define _LCDDATA19_SEG15COM3_LENGTH                         0x1
#define _LCDDATA19_SEG15COM3_MASK                           0x80
#define _LCDDATA19_S08C3_POSN                               0x0
#define _LCDDATA19_S08C3_POSITION                           0x0
#define _LCDDATA19_S08C3_SIZE                               0x1
#define _LCDDATA19_S08C3_LENGTH                             0x1
#define _LCDDATA19_S08C3_MASK                               0x1
#define _LCDDATA19_S09C3_POSN                               0x1
#define _LCDDATA19_S09C3_POSITION                           0x1
#define _LCDDATA19_S09C3_SIZE                               0x1
#define _LCDDATA19_S09C3_LENGTH                             0x1
#define _LCDDATA19_S09C3_MASK                               0x2
#define _LCDDATA19_T3CKPS019_POSN                           0x4
#define _LCDDATA19_T3CKPS019_POSITION                       0x4
#define _LCDDATA19_T3CKPS019_SIZE                           0x1
#define _LCDDATA19_T3CKPS019_LENGTH                         0x1
#define _LCDDATA19_T3CKPS019_MASK                           0x10
#define _LCDDATA19_T3CKPS119_POSN                           0x5
#define _LCDDATA19_T3CKPS119_POSITION                       0x5
#define _LCDDATA19_T3CKPS119_SIZE                           0x1
#define _LCDDATA19_T3CKPS119_LENGTH                         0x1
#define _LCDDATA19_T3CKPS119_MASK                           0x20
#define _LCDDATA19_TMR3CS019_POSN                           0x6
#define _LCDDATA19_TMR3CS019_POSITION                       0x6
#define _LCDDATA19_TMR3CS019_SIZE                           0x1
#define _LCDDATA19_TMR3CS019_LENGTH                         0x1
#define _LCDDATA19_TMR3CS019_MASK                           0x40
#define _LCDDATA19_TMR3CS119_POSN                           0x7
#define _LCDDATA19_TMR3CS119_POSITION                       0x7
#define _LCDDATA19_TMR3CS119_SIZE                           0x1
#define _LCDDATA19_TMR3CS119_LENGTH                         0x1
#define _LCDDATA19_TMR3CS119_MASK                           0x80

